cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Modern CLI tools
brew 'bat'
brew 'fd'
brew 'fzf'
brew 'glow'
brew 'ripgrep'
brew 'spark'
brew 'wget'

# Shell integrations
brew 'direnv'
brew 'starship'
brew 'zoxide'

# Git ecosystem
brew 'git'
brew 'git-delta'
brew 'gh'
brew 'lazygit'

# Language toolchains
brew 'go'
brew 'node'
brew 'nvm'
brew 'pyenv'
brew 'uv'

# Editor
brew 'macvim'

# Build tools (ARM cross-compilation for Pico/RPi)
brew 'cmake'
brew 'ccache'
brew 'arm-none-eabi-gcc'
brew 'arm-none-eabi-binutils'

# Device management
brew 'mpremote'

# Network & utilities
brew 'cloudflared'
brew 'imagemagick'
brew 'nmap'
brew 'yt-dlp'

# Fonts
cask 'font-meslo-lg-nerd-font'

# Apps
cask '1password'
cask 'airtable'
cask 'android-platform-tools'
cask 'arq'
cask 'diffusionbee'
cask 'ghostty'
cask 'handbrake'
cask 'messenger'
cask 'notion-calendar'
cask 'plex'
cask 'qlvideo'
cask 'raspberry-pi-imager'
cask 'raycast'
cask 'sonos'
cask 'steam'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'zed'
cask 'zoom'
